# coding="utf-8"
"""
作业：雷小锋项目
1：登录成功后的菜单元素写到basePage中
2.新建一个学员管理的py文件，该文件中有四个菜单信息，柱状图信息，有点击操作
3.新建一个学生档案的py文件，分别有四个tab页，有点击操作，每个页面有搜索操作
"""
"""
周末作业：
1.将程序调通
2.新建测试用例py文件，完成工作台的测试用例
    #用例1：工作台页面个人信息元素的断言
    #用例2：左侧菜单列表的断言
3.新建测试用例py文件，完成学员管理的测试用例
    测试用例1，学员管理页面某个的断言
    测试用例2，学员管理有三个下拉菜单
"""
# m=int(input())
#
# res=sum([x for x in range(100,m=1)])
# A=0
# for i range(100,200):
#     A+=i
#     print(A)

# def sum1(x=100,y=101):
#     return x+y
# print(sum1())
#
# sum2=lambda x,y,z:x+y+z
# print(sum2(2,3,4,))